const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});


// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ ?', ()=> {
  expect(sum(2,5)).toBe(sum(2,5));
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
//1.1 20 + 50 เท่ากับ 70
test('20 + 50 เท่ากับ 70', ()=> {
  expect(sum(20,50)).toBe(70);
});
//1.2 50 + 50 เท่ากับ 100
test('50 + 50 เท่ากับ 100', ()=> {
  expect(sum(50,50)).toBe(100);
});
//1.3 150 + 150 เท่ากับ 300
test('150 + 150 เท่ากับ 300', ()=> {
  expect(sum(150,150)).toBe(300);
});